Repository: Tencent-RTC/TUIKit_iOS
Catalog: room/Resources/Localized/TUIRoomKitLocalized.xcstrings
Source language: en
Languages: ar, ja, zh_hans

# roomkit_toast_raise_hand_rejected
source: Your raise hand request was rejected
ar: تم رفض طلب رفع يدك
ja: 挙手リクエストが拒否されました
zh_hans: 您的举手请求已被拒绝

# roomkit_enter_room_password_title
source: Room password
ar: كلمة مرور الغرفة
ja: 入室パスワード
zh_hans: 入会密码

# roomkit_please_input_room_password
source: Please enter the room password
ar: يرجى إدخال كلمة مرور الغرفة
ja: 入室パスワードを入力してください
zh_hans: 请输入入会密码

# roomkit_password_error
source: Incorrect password
ar: كلمة المرور غير صحيحة
ja: パスワードが間違っています
zh_hans: 密码错误

# roomkit_err_0_success
source: Operation successful
ar: تمت العملية بنجاح
ja: 操作が成功しました
zh_hans: 操作成功

# roomkit_err_general
source: Temporarily unclassified general error
ar: خطأ عام غير مصنف مؤقتاً
ja: 未分類の一般エラー
zh_hans: 暂未归类的通用错误

# roomkit_err_n2_request_rate_limited
source: Request rate limited, please try again later
ar: تم تحديد معدل الطلبات، يرجى المحاولة لاحقاً
ja: リクエストが制限されています。後でもう一度お試しください
zh_hans: 请求被限频，请稍后重试

# roomkit_err_7008_request_rate_limited
source: Request rate limited, please try again later
ar: تم تحديد معدل الطلبات، يرجى المحاولة لاحقاً
ja: リクエストが制限されています。後でもう一度お試しください
zh_hans: 请求被限频，请稍后重试

# roomkit_err_10017_muted_in_room
source: You have been muted in the current room
ar: تم كتم صوتك في الغرفة الحالية
ja: 現在のルームでミュートされています
zh_hans: 当前房间内，您已被禁言

# roomkit_err_7015_sensitive_words
source: Sensitive words are detected, please modify it and try again
ar: تم اكتشاف كلمات حساسة، يرجى التعديل والمحاولة مرة أخرى
ja: 不適切な言葉が検出されました。修正してもう一度お試しください
zh_hans: 检测到敏感词，请修改后重试

# roomkit_err_9522_content_too_long
source: The content is too long, please reduce the content and try again
ar: المحتوى طويل جداً، يرجى تقليل المحتوى والمحاولة مرة أخرى
ja: 内容が長すぎます。内容を短くしてもう一度お試しください
zh_hans: 内容太长，请缩减内容后再试

# roomkit_err_network_error
source: The network is abnormal, please try again later
ar: الشبكة غير طبيعية، يرجى المحاولة لاحقاً
ja: ネットワークエラーです。後でもう一度お試しください
zh_hans: 网络异常，请稍后再试

# roomkit_err_n3_repeat_operation
source: Repeat operation
ar: عملية مكررة
ja: 重複操作
zh_hans: 重复操作

# roomkit_err_n4_roomID_not_match
source: Room ID does not match, please check if you have checked out or changed rooms.
ar: معرف الغرفة غير متطابق، يرجى التحقق مما إذا كنت قد غادرت أو غيرت الغرف.
ja: ルームIDが一致しません。退出または切り替えを確認してください。
zh_hans: 房间 ID 不匹配，请检查是否退房或者切换了房间

# roomkit_err_n1000_sdk_appid_not_found
source: Not found sdkappid, please confirm application info in trtc console
ar: لم يتم العثور على SDKAppID، يرجى تأكيد معلومات التطبيق في وحدة تحكم TRTC
ja: SDKAppIDが見つかりません。TRTCコンソールでアプリ情報を確認してください
zh_hans: 未找到 SDKAppID，请在 腾讯云视立方 SDK 控制台 确认应用信息

# roomkit_err_n1001_invalid_parameter
source: Passing illegal parameters when calling api, check if the parameters are legal
ar: تمرير معلمات غير قانونية عند استدعاء API، تحقق من صحة المعلمات
ja: APIを呼び出す際のパラメータが不正です。パラメータを確認してください
zh_hans: 调用 API 时，传入的参数不合法，检查入参是否合法

# roomkit_err_n1002_not_logged_in
source: Not logged in, please call login api
ar: لم يتم تسجيل الدخول، يرجى استدعاء API تسجيل الدخول
ja: ログインしていません。ログインAPIを呼び出してください
zh_hans: 未登录,请调用 Login 接口

# roomkit_err_n1003_permission_denied
source: Failed to obtain permission, unauthorized audio/video permission, please check if device permission is enabled
ar: فشل الحصول على الإذن، تحقق من تفعيل أذونات الجهاز
ja: 権限の取得に失敗しました。デバイスの権限が有効か確認してください
zh_hans: 获取权限失败，当前未授权音/视频权限，请查看是否开启设备权限

# roomkit_err_n1004_package_required
source: This feature requires an additional package. please activate the corresponding package as needed in the trtc console
ar: تتطلب هذه الميزة باقة إضافية. يرجى تفعيل الباقة المناسبة في وحدة تحكم TRTC
ja: この機能には追加パッケージが必要です。TRTCコンソールで必要なパッケージを有効にしてください
zh_hans: 该功能需要开通额外的套餐，请在 腾讯云视立方 SDK 控制台 按需开通对应套餐

# roomkit_err_n1005_invalid_license
source: License is invalid or expired, please check its validity period in the trtc console. please activate the corresponding package as needed in the trtc console.
ar: الترخيص غير صالح أو منتهي الصلاحية، يرجى التحقق من صلاحيته في وحدة تحكم TRTC.
ja: ライセンスが無効または期限切れです。TRTCコンソールで有効期限を確認してください。
zh_hans: License无效或已过期，请在 腾讯云视立方 SDK控制台确认License有效期

# roomkit_err_n1100_camera_open_failed
source: System issue, failed to open camera. check if camera device is normal
ar: مشكلة في النظام، فشل فتح الكاميرا. تحقق من جهاز الكاميرا
ja: システムの問題でカメラを開けませんでした。カメラデバイスを確認してください
zh_hans: 系统问题，打开摄像头失败。检查摄像头设备是否正常

# roomkit_err_n1101_camera_no_permission
source: Camera has no system authorization, check system authorization
ar: الكاميرا ليس لديها إذن النظام، تحقق من إذن النظام
ja: カメラにシステム権限がありません。システム権限を確認してください
zh_hans: 摄像头没有系统授权, 检查系统授权

# roomkit_err_n1102_camera_occupied
source: Camera is occupied, check if other process is using camera
ar: الكاميرا مشغولة، تحقق مما إذا كانت عملية أخرى تستخدم الكاميرا
ja: カメラが使用中です。他のプロセスがカメラを使用していないか確認してください
zh_hans: 摄像头被占用，检查是否有其他进程使用摄像头

# roomkit_err_n1103_camera_not_found
source: No camera device currently, please insert camera device to solve the problem
ar: لا يوجد جهاز كاميرا حالياً، يرجى توصيل جهاز كاميرا
ja: カメラデバイスがありません。カメラデバイスを接続してください
zh_hans: 当前无摄像头设备，请插入摄像头设备解决该问题

# roomkit_err_n1104_mic_open_failed
source: System issue, failed to open mic. check if mic device is normal
ar: مشكلة في النظام، فشل فتح الميكروفون. تحقق من جهاز الميكروفون
ja: システムの問題でマイクを開けませんでした。マイクデバイスを確認してください
zh_hans: 系统问题，打开麦克风失败。检查麦克风设备是否正常

# roomkit_err_n1105_mic_no_permission
source: Mic has no system authorization, check system authorization
ar: الميكروفون ليس لديه إذن النظام، تحقق من إذن النظام
ja: マイクにシステム権限がありません。システム権限を確認してください
zh_hans: 麦克风没有系统授权，检查系统授权

# roomkit_err_n1106_mic_occupied
source: Mic is occupied
ar: الميكروفون مشغول
ja: マイクが使用中です
zh_hans: 麦克风被占用

# roomkit_err_n1107_mic_not_found
source: No mic device currently
ar: لا يوجد جهاز ميكروفون حالياً
ja: マイクデバイスがありません
zh_hans: 当前无麦克风设备

# roomkit_err_n1108_screen_share_get_source_failed
source: Failed to get screen sharing source (screen and window), check screen recording permissions
ar: فشل الحصول على مصدر مشاركة الشاشة، تحقق من أذونات تسجيل الشاشة
ja: 画面共有ソースの取得に失敗しました。画面録画の権限を確認してください
zh_hans: 获取屏幕分享源（屏幕和窗口）失败，检查屏幕录制权限

# roomkit_err_n1109_screen_share_start_failed
source: Failed to enable screen sharing, check if someone is already screen sharing in the room
ar: فشل تفعيل مشاركة الشاشة، تحقق مما إذا كان شخص آخر يشارك الشاشة
ja: 画面共有の開始に失敗しました。他の人が画面共有中か確認してください
zh_hans: 开启屏幕分享失败，检查房间内是否有人正在屏幕分享

# roomkit_err_n2101_not_in_room
source: This feature can only be used after entering the room
ar: يمكن استخدام هذه الميزة فقط بعد دخول الغرفة
ja: この機能はルームに入室後のみ使用できます
zh_hans: 需要进房后才可使用此功能

# roomkit_err_n2102_owner_cannot_leave
source: Room owner does not support leaving the room, room owner can only close the room
ar: صاحب الغرفة لا يدعم مغادرة الغرفة، يمكنه فقط إغلاق الغرفة
ja: オーナーは退出できません。ルームを閉じることのみ可能です
zh_hans: 房主不支持退房操作，房主只能解散房间

# roomkit_err_n2103_unsupported_in_room_type
source: This operation is not supported in the current room type
ar: هذه العملية غير مدعومة في نوع الغرفة الحالي
ja: 現在のルームタイプではこの操作はサポートされていません
zh_hans: 当前房间类型下不支持该操作

# roomkit_err_n2105_invalid_room_id
source: Illegal custom room id, must be printable ascii characters (0x20–0x7e), up to 48 bytes long
ar: معرف الغرفة المخصص غير قانوني، يجب أن يكون أحرف ASCII قابلة للطباعة، بحد أقصى 48 بايت
ja: ルームIDが不正です。印刷可能なASCII文字（0x20-0x7e）で最大48バイトである必要があります
zh_hans: 创建房间 ID 非法，自定义 ID 必须为可打印 ASCII 字符（0x20–0x7e），最长48个字节

# roomkit_err_n2107_invalid_room_name
source: Illegal room name, maximum 30 bytes, must be utf-8 encoding if contains chinese characters
ar: اسم الغرفة غير قانوني، بحد أقصى 30 بايت، يجب أن يكون بترميز UTF-8
ja: ルーム名が不正です。最大30バイトで、UTF-8エンコーディングである必要があります
zh_hans: 房间名称非法，名称最长30字节，字符编码必须是 UTF-8 ，如果包含中文

# roomkit_err_n2108_user_already_in_other_room
source: User is already in another room, single roomengine instance only supports user entering one room, to enter different room, please leave the room or use new roomengine instance
ar: المستخدم موجود بالفعل في غرفة أخرى، للدخول إلى غرفة مختلفة، يرجى مغادرة الغرفة أو استخدام مثيل جديد
ja: ユーザーは既に別のルームにいます。別のルームに入るには、まず退出するか新しいインスタンスを使用してください
zh_hans: 当前用户已在别的房间内，单个 roomEngine 实例只支持用户进入一个房间，如果要进入不同的房间请先退房或者使用新的 roomEngine 实例

# roomkit_err_n2200_user_not_exist
source: User is not exist
ar: المستخدم غير موجود
ja: ユーザーが存在しません
zh_hans: 用户不存在

# roomkit_err_n2300_need_owner_permission
source: Room owner permission required for operation
ar: مطلوب إذن صاحب الغرفة للعملية
ja: この操作にはオーナー権限が必要です
zh_hans: 需要房主权限才能操作

# roomkit_err_n2301_need_admin_permission
source: Room owner or administrator permission required for operation
ar: مطلوب إذن صاحب الغرفة أو المسؤول للعملية
ja: この操作にはオーナーまたは管理者権限が必要です
zh_hans: 需要房主或者管理员权限才能操作

# roomkit_err_n2310_signal_no_permission
source: No permission for signaling request, e.g. canceling an invite not initiated by yourself
ar: لا يوجد إذن لطلب الإشارة، مثل إلغاء دعوة لم تبدأها بنفسك
ja: シグナリングリクエストの権限がありません。例：自分が開始していない招待のキャンセル
zh_hans: 信令请求无权限，例如取消非自己发起的邀请

# roomkit_err_n2311_signal_invalid_request_id
source: Signaling request id is invalid or has been processed
ar: معرف طلب الإشارة غير صالح أو تمت معالجته
ja: シグナリングリクエストIDが無効または既に処理済みです
zh_hans: 信令请求 ID 无效或已经被处理过

# roomkit_err_n2312_signal_request_duplicated
source: Signal request repetition
ar: تكرار طلب الإشارة
ja: シグナリングリクエストが重複しています
zh_hans: 信令请求重复

# roomkit_err_n2340_seat_count_limit_exceeded
source: Maximum seat exceeds package quantity limit
ar: الحد الأقصى للمقاعد يتجاوز حد الباقة
ja: 最大席数がパッケージ数量制限を超えています
zh_hans: 最大麦位超出套餐包数量限制

# roomkit_err_n2344_seat_not_exist
source: Seat serial number does not exist
ar: رقم المقعد التسلسلي غير موجود
ja: 席番号が存在しません
zh_hans: 麦位编号不存在

# roomkit_err_n2360_seat_audio_locked
source: Current seat audio is locked
ar: صوت المقعد الحالي مقفل
ja: 現在の席のオーディオがロックされています
zh_hans: 当前麦位音频被锁

# roomkit_err_n2361_mic_need_request_permission
source: Need to apply to room owner or administrator to open mic
ar: يجب التقدم لصاحب الغرفة أو المسؤول لفتح الميكروفون
ja: マイクを開くにはオーナーまたは管理者に申請が必要です
zh_hans: 需要向房主或管理员申请后打开麦克风

# roomkit_err_n2370_seat_video_locked
source: Current seat video is locked, need room owner to unlock mic seat before opening camera
ar: فيديو المقعد الحالي مقفل، يحتاج صاحب الغرفة لفتح القفل قبل تشغيل الكاميرا
ja: 現在の席のビデオがロックされています。カメラを開くにはオーナーによる解除が必要です
zh_hans: 当前麦位视频被锁, 需要由房主解锁麦位后，才能打开摄像头

# roomkit_err_n2371_camera_need_request_permission
source: Need to apply to room owner or administrator to open camera
ar: يجب التقدم لصاحب الغرفة أو المسؤول لفتح الكاميرا
ja: カメラを開くにはオーナーまたは管理者に申請が必要です
zh_hans: 需要向房主或管理员申请后打开摄像头

# roomkit_err_n2372_screen_share_seat_locked
source: The current microphone position video is locked and needs to be unlocked by the room owner before screen sharing can be enabled
ar: فيديو موضع الميكروفون الحالي مقفل ويحتاج لفتح القفل من صاحب الغرفة قبل تفعيل مشاركة الشاشة
ja: 現在の席のビデオがロックされています。画面共有を開くにはオーナーによる解除が必要です
zh_hans: 当前麦位视频被锁, 需要由房主解锁麦位后，才能打开屏幕分享

# roomkit_err_n2373_screen_share_need_permission
source: Screen sharing needs to be enabled after applying to the room owner or administrator
ar: يجب تفعيل مشاركة الشاشة بعد التقدم لصاحب الغرفة أو المسؤول
ja: 画面共有を開くにはオーナーまたは管理者に申請が必要です
zh_hans: 需要向房主或管理员申请后打开屏幕分享

# roomkit_err_n2380_all_members_muted
source: All members muted in the current room
ar: تم كتم صوت جميع الأعضاء في الغرفة الحالية
ja: 現在のルームで全員ミュートが有効です
zh_hans: 当前房间已开启全员禁言

# roomkit_err_n4001_room_not_support_preload
source: The current room does not support preloading
ar: الغرفة الحالية لا تدعم التحميل المسبق
ja: 現在のルームはプリロードをサポートしていません
zh_hans: 当前房间不支持预加载

# roomkit_err_n6001_device_busy_during_call
source: The device operation failed while in a call
ar: فشلت عملية الجهاز أثناء المكالمة
ja: 通話中のため、デバイス操作に失敗しました
zh_hans: 正在通话中，设备操作失败

# roomkit_err_100001_server_internal_error
source: Server internal error, please retry
ar: خطأ داخلي في الخادم، يرجى إعادة المحاولة
ja: サーバー内部エラーです。再試行してください
zh_hans: 服务器内部错误，请重试

# roomkit_err_100002_server_invalid_parameter
source: The parameter is illegal. check whether the request is correct according to the error description
ar: المعلمة غير قانونية. تحقق مما إذا كان الطلب صحيحاً وفقاً لوصف الخطأ
ja: パラメータが不正です。エラーの説明に従ってリクエストを確認してください
zh_hans: 请参数非法，请根据错误描述检查请求是否正确

# roomkit_err_100003_room_id_already_exists
source: The room id already exists. please select another room id
ar: معرف الغرفة موجود بالفعل. يرجى اختيار معرف آخر
ja: ルームIDは既に使用されています。別のルームIDを選択してください
zh_hans: 房间ID 已被使用，请选择别的房间ID

# roomkit_err_100004_room_not_exist
source: The room does not exist, or it once existed but has now been dissolved
ar: الغرفة غير موجودة، أو كانت موجودة ولكن تم حلها
ja: ルームが存在しないか、既に解散されています
zh_hans: 房间不存在，或者曾经存在过，但是目前已经被解散

# roomkit_err_100005_not_room_member
source: Not a room member
ar: ليس عضواً في الغرفة
ja: ルームメンバーではありません
zh_hans: 非房间成员

# roomkit_err_100006_operation_not_allowed
source: You are currently unable to perform this operation (possibly due to lack of permission or scenario restrictions)
ar: لا يمكنك حالياً تنفيذ هذه العملية (ربما بسبب نقص الإذن أو قيود السيناريو)
ja: この操作を実行できません（権限がないか、シナリオ制限のため）
zh_hans: 您当前无法执行此操作（可能是无权限，或受场景限制等原因）

# roomkit_err_100007_no_payment_info
source: No payment information, you need to purchase a package in the console
ar: لا توجد معلومات دفع، تحتاج لشراء باقة في وحدة التحكم
ja: 支払い情報がありません。コンソールでパッケージを購入してください
zh_hans: 无付费信息，需在控制台购买套餐包

# roomkit_err_100008_room_is_full
source: The room is full
ar: الغرفة ممتلئة
ja: ルームが満員です
zh_hans: 房间成员已满

# roomkit_err_100009_room_tag_limit_exceeded
source: Tag quantity exceeds upper limit
ar: عدد العلامات يتجاوز الحد الأعلى
ja: タグ数が上限を超えています
zh_hans: 标签数量超上限

# roomkit_err_100010_room_id_reusable_by_owner
source: The room id has been used, and the operator is the room owner, it can be used directly
ar: تم استخدام معرف الغرفة، والمشغل هو صاحب الغرفة، يمكن استخدامه مباشرة
ja: ルームIDは既に使用されており、操作者がオーナーの場合は直接使用できます
zh_hans: 房间 ID 已被使用，并且操作者为房主，可以直接使用

# roomkit_err_100011_room_id_occupied_by_im
source: The room id has been occupied by chat. you can use a different room id or dissolve the group first
ar: معرف الغرفة مشغول بواسطة الدردشة. يمكنك استخدام معرف مختلف أو حل المجموعة أولاً
ja: ルームIDはIMに使用されています。別のルームIDを使用するか、グループを解散してください
zh_hans: 房间 ID 已被 IM 占用，可以换一个房间 ID 使用，或者先通过 IM 接口解散该群

# roomkit_err_100012_create_room_frequency_limit
source: Creating rooms exceeds the frequency limit, the same room id can only be created once within 1 second
ar: تجاوز إنشاء الغرف حد التردد، يمكن إنشاء نفس معرف الغرفة مرة واحدة فقط في الثانية
ja: ルーム作成の頻度制限を超えています。同じルームIDは1秒に1回のみ作成可能です
zh_hans: 频率超过限制，例如创建房间超过频率超限，同一房间 ID， 1秒内只能创建一次

# roomkit_err_100013_payment_limit_exceeded
source: Exceeds the upper limit, for example, the number of microphone seats, the number of pk match rooms, etc., exceeds the payment limit
ar: تجاوز الحد الأعلى، مثل عدد المقاعد وعدد غرف مباريات PK وما إلى ذلك
ja: 支払い上限を超えています。例：席数、PKマッチルーム数などが支払い制限を超えています
zh_hans: 超过付费上限，例如麦位数，pk场次房间数量等超过付费限制

# roomkit_err_100015_invalid_room_type
source: Invalid room type
ar: نوع غرفة غير صالح
ja: 無効なルームタイプ
zh_hans: 无效的房间类型

# roomkit_err_100016_member_already_banned
source: This member has been banned
ar: تم حظر هذا العضو
ja: このメンバーは既にBANされています
zh_hans: 该成员已经被封禁

# roomkit_err_100017_member_already_muted
source: This member has been muted
ar: تم كتم صوت هذا العضو
ja: このメンバーは既にミュートされています
zh_hans: 该成员已经被禁言

# roomkit_err_100018_room_password_required
source: The current room requires a password for entry
ar: الغرفة الحالية تتطلب كلمة مرور للدخول
ja: このルームに入るにはパスワードが必要です
zh_hans: 当前房间需要密码才能进入

# roomkit_err_100019_room_password_incorrect
source: Room entry password error
ar: خطأ في كلمة مرور دخول الغرفة
ja: ルーム入室パスワードが間違っています
zh_hans: 进房密码错误

# roomkit_err_100020_admin_limit_exceeded
source: The administrator list is full
ar: قائمة المسؤولين ممتلئة
ja: 管理者の人数が上限に達しました
zh_hans: 管理员数量已达上限

# roomkit_err_100102_signal_request_conflict
source: Signal request conflict
ar: تعارض طلب الإشارة
ja: シグナリングリクエストの競合
zh_hans: 信令请求冲突

# roomkit_err_100200_seat_is_locked
source: The seat is locked. you can try another seat
ar: المقعد مقفل. يمكنك تجربة مقعد آخر
ja: 席がロックされています。別の席をお試しください
zh_hans: 麦位已锁定，可以尝试换一个麦位

# roomkit_err_100201_seat_is_occupied
source: The current seat is already occupied
ar: المقعد الحالي مشغول بالفعل
ja: 現在の席は既に使用されています
zh_hans: 当前麦位已经有人了

# roomkit_err_100202_already_in_seat_queue
source: Already on the seat queue
ar: موجود بالفعل في قائمة انتظار المقاعد
ja: 既に席待ちキューにいます
zh_hans: 已经处于排麦状态

# roomkit_err_100203_already_on_seat
source: Already on the seat
ar: موجود بالفعل على المقعد
ja: 既に席についています
zh_hans: 已经处于麦上状态

# roomkit_err_100204_not_in_seat_queue
source: Not on the seat queue
ar: ليس في قائمة انتظار المقاعد
ja: 席待ちキューにいません
zh_hans: 没有在排麦列表中

# roomkit_err_100205_all_seats_are_full
source: The participant list is full.
ar: قائمة الضيوف ممتلئة.
ja: ゲストの人数が上限に達しました。
zh_hans: 嘉宾数量已达上限

# roomkit_err_100206_not_on_seat
source: Please become a participant first
ar: يرجى أن تصبح ضيفًا أولاً
ja: まずゲストになってください
zh_hans: 请先成为嘉宾

# roomkit_err_100210_user_already_on_seat
source: The user is already on the seat
ar: المستخدم موجود بالفعل على المقعد
ja: ユーザーは既に席についています
zh_hans: 已经有用户在麦位上

# roomkit_err_100211_seat_not_supported
source: The room does not support seat ability
ar: الغرفة لا تدعم ميزة المقاعد
ja: このルームは席機能をサポートしていません
zh_hans: 该房间不支持连麦

# roomkit_err_100251_seat_list_is_empty
source: The seat list is empty
ar: قائمة المقاعد فارغة
ja: 席リストが空です
zh_hans: 连麦列表为空

# roomkit_err_100253_speaker_seat_occupied
source: The speaker seat is already occupied. Unable to enable the device
ar: مقعد المتحدث الرئيسي مشغول بالفعل. لا يمكن تشغيل الجهاز
ja: メインスピーカー席は既に占有されています。デバイスを有効にできません
zh_hans: 主讲嘉宾席位已被占用，无法开启设备

# roomkit_err_100500_room_metadata_key_limit
source: The number of keys in the room's metadata exceeds the limit
ar: عدد المفاتيح في البيانات الوصفية للغرفة يتجاوز الحد
ja: ルームメタデータのキー数が上限を超えています
zh_hans: 房间 meta 数据中的 key 数量超过上限

# roomkit_err_100501_room_metadata_value_limit
source: The size of value in the room's metadata exceeds the maximum byte limit
ar: حجم القيمة في البيانات الوصفية للغرفة يتجاوز الحد الأقصى للبايت
ja: ルームメタデータの値サイズが最大バイト制限を超えています
zh_hans: 房间 meta 数据中单个 key 对应的 val 超过最大字节数限制

# roomkit_err_100502_room_metadata_total_limit
source: The total size of all value in the room's metadata exceeds the maximum byte limit
ar: الحجم الإجمالي لجميع القيم في البيانات الوصفية للغرفة يتجاوز الحد الأقصى للبايت
ja: ルームメタデータの全値の合計サイズが最大バイト制限を超えています
zh_hans: 房间 meta数据中所有 key 对应的 val 总和超过最大字节数限制

# roomkit_err_100503_room_metadata_no_valid_keys
source: There is no valid keys when delete metadata
ar: لا توجد مفاتيح صالحة عند حذف البيانات الوصفية
ja: メタデータ削除時に有効なキーがありません
zh_hans: 删除房间 meta 数据时候，被删除的 key 没有一个存在

# roomkit_err_100504_room_metadata_key_size_limit
source: The size of key in the room's metadata exceeds the maximum byte limit
ar: حجم المفتاح في البيانات الوصفية للغرفة يتجاوز الحد الأقصى للبايت
ja: ルームメタデータのキーサイズが最大バイト制限を超えています
zh_hans: 房间 meta 数据中的 key 大小超过了最大字节数限制

# roomkit_err_7002_invalid_user_id
source: Invalid userid
ar: معرف مستخدم غير صالح
ja: 無効なユーザーID
zh_hans: 非法的userId

# roomkit_barrage_text_hint
source: Join Chat!
ar: قل شيئاً…
ja: 何か言ってみましょう…
zh_hans: 说点什么…

# roomkit_barrage_btn_send
source: Send
ar: إرسال
ja: 送信
zh_hans: 发送

# roomkit_privacy_screen_share_tip_title
source: Security reminder
ar: تذكير الأمان
ja: セキュリティリマインダー
zh_hans: 安全提醒

# roomkit_privacy_screen_share_tip_content
source: Screen sharing may leak private information such as SMS verification codes and passwords, causing property loss. Please be vigilant against various fraudulent activities.
ar: قد تؤدي مشاركة الشاشة إلى تسريب معلومات خاصة مثل رموز التحقق عبر الرسائل القصيرة وكلمات المرور، مما يتسبب في خسائر مالية. يرجى توخي الحذر ضد الأنشطة الاحتيالية المختلفة.
ja: 画面共有によりSMS認証コードやパスワードなどの個人情報が漏洩し、財産損失を引き起こす可能性があります。様々な詐欺行為にご注意ください。
zh_hans: 共享屏幕时可能会泄露短信验证码、密码等隐私信息，造成财产损失，请警惕各种诈骗行为。

# roomkit_privacy_screen_share_tip_continue
source: Continue sharing
ar: متابعة المشاركة
ja: 共有を続行
zh_hans: 继续共享

# roomkit_unable_to_shared_screen
source: Please contact us to experience this feature
ar: يرجى الاتصال بنا لتجربة هذه الميزة
ja: この機能を使用するにはお問い合わせください
zh_hans: 如需体验该功能请联系我们

# roomkit_tips
source: Friendly reminder
ar: تذكير ودّي
ja: ご案内
zh_hans: 温馨提示

# roomkit_contact_us
source: Contact us
ar: اتصل بنا
ja: お問い合わせ
zh_hans: 联系我们
